ProgrammingTestTask-1/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеСрокаГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ProgrammingTestTask-1/src/Documents/СписаниеПросрочки/СписаниеПросрочки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеПросрочки</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСрокаГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ProgrammingTestTask-1/src/CommonModules/ОбщегоНазначенияВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Получает данные о сроке годности Номенклатуры в виде Структуры
// 
// Параметры:
// 	Номенклатура - СправочникСсылка.Номенклатура -
// 	ДатаПроизводства - Дата -
// Возвращаемое значение:
// 	Структура - Структура с данными о сроке годности:
// * ОкончаниеСрокаГодности - Дата -
// * СрокГодности - Число -
Функция ПолучитьДанныеОСрокеГодностиНоменклатуры(Номенклатура, ДатаПроизводства) Экспорт

	ДанныеОСрокеГодности = Новый Структура("СрокГодности, ОкончаниеСрокаГодности");

	Если НЕ ЗначениеЗаполнено(ДатаПроизводства) Тогда
		Возврат ДанныеОСрокеГодности;
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.СрокГодности КАК СрокГодности,
		|	ДОБАВИТЬКДАТЕ(&ДатаПроизводства, ДЕНЬ, Номенклатура.СрокГодности) КАК ОкончаниеСрокаГодности
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", 		Номенклатура);
	Запрос.УстановитьПараметр("ДатаПроизводства", 	ДатаПроизводства);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ДанныеОСрокеГодности, Выборка);
	КонецЕсли; 

	Возврат ДанныеОСрокеГодности;

КонецФункции

// Добавляет к дате количество дней
// 
// Параметры:
// 	Дата
// 	КоличествоДней
// Возвращаемое значение:
// 	Дата
Функция ДобавитьКДатеКоличествоДней(Дата, КоличествоДней) Экспорт
	СекундВСутках = 86400;
	Возврат Дата + КоличествоДней * СекундВСутках;
КонецФункции

// Вычисляет количество дней между двумя датами
// 
// Параметры:
// 	Дата1
// 	Дата2
// Возвращаемое значение:
// 	Число - Количество дней между двумя датами
Функция ВычислитьКоличествоДнейМеждуДатами(Дата1, Дата2) Экспорт
	СекундВСутках = 86400;
	Возврат (Дата1 - Дата2) / СекундВСутках;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СписаниеПросрочки() Экспорт
	КонецВчерашнегоДня = НачалоДня(ТекущаяДатаСеанса()) - 1;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ОкончаниеСрокаГодности", Новый Диапазон(, КонецВчерашнегоДня));
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровОстатки.ОкончаниеСрокаГодности КАК ОкончаниеСрокаГодности,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
			|	ОстаткиТоваровОстатки.СтоимостьОстаток КАК Стоимость
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваров.Остатки(, ОкончаниеСрокаГодности < &ТекущаяДата) КАК ОстаткиТоваровОстатки";
		
		Запрос.УстановитьПараметр("ТекущаяДата", КонецВчерашнегоДня);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Списание = Документы.СписаниеПросрочки.СоздатьДокумент();
			Списание.Дата = КонецВчерашнегоДня;
			Списание.Товары.Загрузить(РезультатЗапроса.Выгрузить());
			Списание.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = СтрШаблон("При автоматическом списании просрочки произошла ошибка: %1", ОписаниеОшибки);
		ЗаписьЖурналаРегистрации("Автоматическое списание просрочки", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
